submission/app/controllers/api/v1/lgas_controller.rb

SELECT "lgas".* FROM "lgas"
---
  def index
    @pagy, @lgas = pagy(Lga.all, items: 5)

SELECT "lgas".* FROM "lgas" WHERE "lgas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_lga
    render json: { error: "ID #{params[:id]} is not an integer" }, status: 400 and return unless is_integer(params[:id])
    begin
      @lga = Lga.find(params[:id])